[
    {
        "id": 1,
        "title": "First Post!",
        "date": "Nov 29 2024, 2:15AM - 2:44AM",
        "content": "Hi all! I've been up for hours trying to code this, looool. I finally got the modal pop-up to work, so click \"Read More\" to see it! I also decided to make it more fun (mostly for myself Lol) and add passwords to some posts!! I added a sample post below this just to try it out. You can find the password in my genblog.py file in the github repo for this website. I'll probably change it every so often to entertain myself.<br>The CSS for this part of the site is suuuper bland right now, I'm thinking of fixing it over the weekend. Right now, this will just have to do! I also need some ideas for how I want it to look... I was thinking about \"magazine style\" but I'm not really sure how I'd go about it without totally overcomplicating it. If you have any ideas, send them my way!! I'll even credit you at the bottom of each blog page loool you can add to the github discussion :) okay goodnight i'm so tired djskfjhdflhsdfha",
        "password": false
    },
    {
        "id": 2,
        "title": "goodbye blue silohuette",
        "date": "December 14 2024, 11:30PM - 11:48PM",
        "content": "there is a lot that i do not know and a lot that i still need to experience one day. i'm still young and haven't even passed into adulthood yet, but i feel that some values and beliefs i hold are and will continue to be unwavering traits of my character. some things you do not need a lifetime's worth of trials and experiences to have wisdom about; you just know it. and every time i close my eyes to go to sleep, blue silohuettes of our dreams appear in my mind. it's practically nonsense for a child's play of makebelieve, but i would like to believe that it was real at some point. i would like to imagine that you meant all of it at some point. you can claim that it was all for show and to please me at some point, but it was real. it was undeniably real. and one day i will move past your blue silohuette and pretend i did not know it. i won't even look it in the face. i'll gather all of our dreams in my pocket and i will find a new silohuette to share them with. and this time, your silohuette will not be blue; it will not exist. because i do not know you. i never knew you. we never shared our thoughts and we never made new ones together. we never smiled at each other and we never made corny jokes to hear each other laugh, even if for a millisecond. we never met on that street and you never told me you wanted to spend the rest of your life with me. because it was not you. you did not tell me these things. it was a different you, a piece that i made up. the version of you i would see in my dreams, that blue silohuette, followed me into my conscious world and pretended to be you. and once it all crumbled, the silohuette ran away. i realized that all of it was just a dream. you were not truly who you made me think you were. i guess i'm okay to let you go. i will go to sleep tonight and wave goodbye to the blue silohuette, the piece of you that was real to me. i will admit that it is difficult. i did not know that people could turn so cold so quickly. maybe your blueness was foreshadowing. the warm summer waters turned to a cold icy blue in the winter. maybe it was not foreshadowing. you would tell me i'm being dramatic again. that i'm doing too much. that i read too much into things. i do not agree with your words anymore. i think you do not read into things enough. you do not do enough. you are not emotional enough. you are hard to love. even after giving every drop of my love to you, you still did not have any to learn from. i hope you do okay in this lifetime. maybe in another parallel universe, we were meant to be blue silohuettes together.",
        "password": true
    },
    {
        "id": 3,
        "title": "Ortho",
        "date": "December 16 2024, 11:49PM - ",
        "content": "it's really tempting to add a password to each and every post but i'll try to limit my use of the feature as much as i can force myself to! i had an orthodontist appointment today because my old retainer broke about a little over a month ago. they took a scan of my teeth again. not much shifting, my teeth are still about the same as before. i decided to get an invisalign subscription this time so i'm going back in two weeks to pick up my new retainer. i'm still really confused as to why they didn't give me an invisalign option when i first got my retainers like two years ago lol. <br> anyway, that's it. i just wanted to write something down real quick. i actually wanted to write way more but it's too personal for an unlocked post. maybe next time. honestly i might not write it at all. i don't want to get too comfortable airing my personal life on the internet like this. there's boundaries meant not to be crossed, you know. maybe if all of this wasn't linked right back to me and could stay completely anonymous, i'd have an easier time writing my heart out on here. next website i guess. i wonder how long it'll take me before i abandon this one too. i think it's like my fourth, but this time i really want this one to work out. it's too personal not to.",
        "password": false
    },
    {
        "id": 4,
        "title": "Post 4",
        "date": "N/A",
        "content": "Cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id.",
        "password": false
    },
    {
        "id": 5,
        "title": "Post 4",
        "date": "N/A",
        "content": "Cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id.",
        "password": false
    },
    {
        "id": 6,
        "title": "Post 4",
        "date": "N/A",
        "content": "Cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id.",
        "password": false
    }
]
